Chapters/Chapter_5/free_decay_tests/SURGE_OC6/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"
#include "../myVars" //Include global variables

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    floater.stl 
    {
        type triSurfaceMesh; 
        name floater;
    }

    float_sphere
    {
    type            searchableSphere;
    centre          (0 0 -4);
    radius          #calc "1.1*40.87";
    }



    FS_4 // Free-surface level3
    {
        type searchableBox;
        min (#calc "$xmin+$in_len"   #calc "0.5*$ymin"   #calc "-1.0*$wave_height");
        max (#calc "$xmax-$out_len"   #calc "0.5*$ymax"   #calc "1.0*$wave_height"); 
    }

    FS_3 //free-surface level2
    {
        type searchableBox;
        min ($xmin   $ymin   #calc "-1.0*$wave_height");
        max ($xmax   $ymax   #calc "1.0*$wave_height"); 
    }

    /*FS_2 //smaller block, more refined
    {
        type    searchableBox;
        min     ($xmin  $ymin #calc "-8*$wave_height");
        max     ($xmax   $ymax #calc "8*$wave_height" );
    }

    FS_1 //bigger block, less refined
    {
        type    searchableBox;
        min     ($xmin  #calc "$ymin" #calc "-6*$wave_height");
        max     ($xmax  #calc "$ymax" #calc "6*$wave_height" );
    }
*/
}

// https://www.openfoam.com/documentation/guides/latest/doc/guide-meshing-snappyhexmesh-castellation.html
castellatedMeshControls
{
    maxLocalCells 10000000; // max number of cells per processor during refinement
    maxGlobalCells 10000000; // overall cell limit during refinement, before removal
    minRefinementCells 0; // cells to be refined must be greater than this value
    nCellsBetweenLevels 2; // number of buffer layers of cells between successive levels of refinement, typically 3
    locationInMesh (0.011112 0.123456 -30.11025514); //location vector inside the region to be meshed. Use weird numbers to avoid falling just at an edge. 
    resolveFeatureAngle 30;

    features
    (
      // allows explicit feature edge refinement and a level is chosen for any cell intersected by its edges

    );

    refinementSurfaces
    {
        // surface based refinement
        // Every surface is specified with two levels
        // The first level is the minimum level that every cell intersecting the surface gets refined up to
        // The second level is the maximum level of refinement.
        floater
        {
            level (3 3);
        }

        patchInfo
        {
          type wall;
 
          // Optional group
          // inGroups (meshedWalls);
        }
        //perpendicularAngle 10;
    }

    refinementRegions
    {
        /*FS_2
        {
            mode inside;
            levels ((1e-5 1)); //First entry here is distance, which will be ignored unless mode = distance
        }*/
        FS_4 //free surface level 3
        {
            mode inside;
            levels ((1e-5 3)); //First entry here is distance, which will be ignored unless mode = distance
        }
	
        FS_3 //free surface level 2
        {
            mode inside;
            levels ((1e-5 2));
        }

        float_sphere
        {
            mode inside;
            levels ((1e-5 2)); //First entry here is distance, which will be ignored unless mode = distance
        }

        

       /* FS_1
        {
            mode inside;
            levels ((1e-5 1)); //First entry here is distance, which will be ignored unless mode = distance
        }
        */
    }

    allowFreeStandingZoneFaces  false;

    // Optional: switch off topological test for cells to-be-squashed
    //           and use geometric test instead
    useTopologicalSnapDetection false;
}

snapControls  //moving cell vertex points onto surface geometry to remove the jagged castellated surface from the mesh
{
     nSmoothPatch 3; //Number of patch smoothing iterations before finding correspondence to surface (typically 3)
     tolerance 2.0; //ratio of distance for points to be attracted by surface feature point or edge, to local maximum edge length   
     nSolveIter 40;// Number of mesh displacement relaxation. The higher the value the better the body fitted mesh. Default is 30. (typically 30-100). Increase to 300 for better mesh quality, but increased time. 
     nRelaxIter 6; //Maximum number of snapping relaxation iterations. Increase this value to improve the quality of the body fitted mesh.        
     nFeatureSnapIter 10; //Number of feature edge snapping iterations. Increase this value to improve the quality of the edge features.     

     implicitFeatureSnap false; // Turn to true when the body you want to snap is a geometric entity (sphere, cylinder, etc), not a file stl        
     explicitFeatureSnap false; // If true, will use the file defined in castellatedMeshControls::features         
     multiRegionFeatureSnap false; 
}

addLayersControls //The process of mesh layer addition involves shrinking the existing mesh from the boundary and inserting layers of cells
{
  relativeSizes true; // if true, BL meshing is done relative to the size of the cells next to the surface. It is quite difficult to set a desired thickness of the first layer.
  // When the option relativeSizes is true and in order to have a uniform boundary layer, we need to have a uniform surface refinement.
  layers //it introduce 5 layers of cells next to the stl surface, with an increase in size of 1.05, 
	 //with the thickness of the furthest layer from the surface of #finalLayerThickness and the thickenss of all cel layers
	 //of $BL_thick
	 //
  {
      floater
      {
          nSurfaceLayers    5; //check this value
      }
  } 

  expansionRatio 1.08;		//check this value
  //thickness $BL_thick;      //check this value
  finalLayerThickness $BL_thick;  //check this value   
  minThickness 0.1;     
  nGrow 0;     
  featureAngle 150;  // Increase this value to avoid BL collapsing   
  nRelaxIter 5;     
  nSmoothSurfaceNormals 1;     
  nSmoothNormals 3;     
  nSmoothThickness 10;     
  maxFaceThicknessRatio 0.5;     
  maxThicknessToMedialRatio 0.3;     
  minMedianAxisAngle 90;     
  nBufferCellsNoExtrude 0; 
  nLayerIter 50; 
  nRelaxedIter 20; 
}

meshQualityControls
{
    //- Maximum non-orthogonality angle allowed. Set to 180 to disable.
    maxNonOrtho 75;
    
    //- Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    
    //- Max concaveness allowed. Is angle (in degrees) below which concavity
    //  is allowed. 0 is straight face, <0 would be convex face.
    //  Set to 180 to disable.
    maxConcave 80;
    
    //- Minimum pyramid volume. Is absolute volume of cell pyramid.
    //  Set to a sensible fraction of the smallest cell volume expected.
    //  Set to very negative number (e.g. -1E30) to disable.
    minVol 1e-13;
    
    //- Minimum quality of the tet formed by the face-centre
    //  and variable base point minimum decomposition triangles and
    //  the cell centre. Set to very negative number (e.g. -1E30) to
    //  disable.
    //     <0 = inside out tet,
    //      0 = flat tet
    //      1 = regular tet
    minTetQuality -1e+20;
    
    //- Minimum face area. Set to <0 to disable.
    minArea 1e-13;
    
    //- Minimum face twist. Set to <-1 to disable. dot product of face normal
    // and face centre triangles normal
    minTwist 0.02;
    
    //- Minimum normalised cell determinant. This is the determinant of all
    //  the areas of internal faces. It is a measure of how much of the
    //  outside area of the cell is to other cells. The idea is that if all
    //  outside faces of the cell are 'floating' (zeroGradient) the
    //  'fixedness' of the cell is determined by the area of the internal faces.
    //  1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;
    
    //- Relative position of face in relation to cell centres (0.5 for orthogonal
    //  mesh) (0 -> 0.5)
    minFaceWeight 0.05;
    
    //- Volume ratio of neighbouring cells (0 -> 1)
    minVolRatio 0.01;
    
    //- Per triangle normal compared to average normal. Like face twist
    //  but now per (face-centre decomposition) triangle. Must be >0 for Fluent
    //  compatibility
    minTriangleTwist -1;

    errorReduction 0.75; //amount to scale back displacement at error points 
    nSmoothScale 4; // number of error distribution iterations (typically 4)
    minFlatness 0.5;
}


mergeTolerance 1e-6;

/*
debugFlags
(
    // write intermediate meshes
    mesh
    // write current mesh intersections as .obj files
    intersections
    // write information about explicit feature edge
    // refinement
    featureSeeds
    // write attraction as .obj files
    attraction
    // write information about layers
    layerInfo
);
writeFlags
(
    // write volScalarField with cellLevel for
    // postprocessing
    scalarLevels
    // write cellSets, faceSets of faces in layer
    layerSets
    // write volScalarField for layer coverage
    layerFields
);
*/

// ************************************************************************* //
